Emacs.org
** Corfu

#+begin_src emacs-lisp

  (use-package corfu
    :custom
    (corfu-auto t)
    (corfu-auto-prefix 1)
    (corfu-auto-delay 0.0)
    :init
    (global-corfu-mode))

  (setq tab-always-indent 'complete)

#+end_src

#+RESULTS:
: complete

** Cape

#+begin_src emacs-lisp

  (use-package cape
    :init
    (add-to-list 'completion-at-point-functions #'cape-file)
    (add-to-list 'completion-at-point-functions #'cape-dabbrev))

#+end_src

#+RESULTS:

** Orderless

#+begin_src emacs-lisp

  (use-package orderless
    :init
    (setq completion-styles '(orderless partial-completion basic)
          completion-category-defaults nil
          completion-category-overrides nil))

#+end_src

** LSP Mode
*** Language Servers

#+begin_src emacs-lisp

  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :init
    (setq lsp-keymap-prefix "C-c s")
    (defun pry/lsp-mode-setup-completion ()
      (setq-local completion-styles '(orderless)
                  completion-category-defaults nil))
    :hook
    (lsp-mode . pry/lsp-mode-setup-completion)
    (lsp-mode . smart-semicolon-mode)
    :custom
    (lsp-completion-provider :none)
    :config
    (setq gc-cons-threshold (* 100 1024 1024))
    (setq lsp-idle-delay 0.1)
    (setq read-process-output-max (* 1024 1024))
    (lsp-enable-which-key-integration t)
    (setq lsp-enable-completion-at-point nil))

  (add-hook 'text-mode-hook (lambda ()
                        (setq-local lsp-completion-enable nil)))

#+end_src

#+RESULTS:
| (lambda nil (setq-local lsp-completion-enable nil)) | text-mode-hook-identify |

*** Languages
**** C/C++

#+begin_src emacs-lisp

  (add-hook 'c-mode-hook 'lsp)
  (add-hook 'c++-mode-hook 'lsp)

#+end_src

#+RESULTS:
| lsp |
**** C#

#+begin_src emacs-lisp

  (use-package csharp-mode
  :ensure t
  :init
  (defun my/csharp-mode-hook ()
    (setq-local lsp-auto-guess-root t)
    (lsp))
  (add-hook 'csharp-mode-hook #'my/csharp-mode-hook))

#+end_src

#+RESULTS:

*** Unity

#+begin_src emacs-lisp

  (setenv "FrameworkPathOverride" "/lib/mono/4.5")
  (straight-use-package
   '(unity :type git :host github :repo "elizagamedev/unity.el"
           :files ("*.el" "*.c")))
  (add-hook 'after-init-hook #'unity-build-code-shim)
  (add-hook 'after-init-hook #'unity-setup)

#+end_src

#+RESULTS:
| unity-setup | unity-build-code-shim | x-wm-set-size-hint | tramp-register-archive-file-name-handler | magit-maybe-define-global-key-bindings | magit-auto-revert-mode--init-kludge | magit-startup-asserts | magit-version | forge-startup-asserts | table--make-cell-map |

** Comment lines

#+begin_src emacs-lisp
    (use-package evil-nerd-commenter
      :bind ("M-/" . evilnc-comment-or-uncomment-lines))
#+end_src

#+RESULTS:
: evilnc-comment-or-uncomment-lines

* Terminal
** Term mode

#+begin_src emacs-lisp

  (use-package term
    :config
    (setq explicit-shell-file-name "bash")
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))

  (use-package eterm-256color
    :hook (term-mode . eterm-256color-mode))

#+end_src

#+RESULTS:
| eterm-256color-mode | evil-collection-term-escape-stay | evil-collection-term-sync-state-and-mode |
** Vterm

#+begin_src emacs-lisp

      (use-package vterm
        :commands vterm
        :config
        (setq vterm-max-scrollback 10000))

#+end_src

#+RESULTS:
: t

* Misc.
** Command Log Mode

#+begin_src emacs-lisp

  (use-package command-log-mode)
  (global-command-log-mode)

#+end_src

** Ace Jump Mode

#+begin_src emacs-lisp

  (use-package ace-jump-mode)
  (define-key global-map (kbd "M-s") 'ace-jump-mode)
  
#+end_src

** Helpful

#+begin_src emacs-lisp

  (use-package helpful
    :custom
    (describe-function-function #'helpful-callable)
    (describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))

#+end_src

** Ace Window

#+begin_src emacs-lisp

  (use-package ace-window)
  (global-set-key (kbd "C-x o") 'ace-window)
  
#+end_src

** Lorem Ipsum

#+begin_src emacs-lisp

  (use-package lorem-ipsum)
  (lorem-ipsum-use-default-bindings)
  
#+end_src

** Spotify

#+begin_src emacs-lisp

          (use-package counsel-spotify)
          (defun read-from-file (f)
            (with-temp-buffer
              (insert-file-contents f)
              (buffer-substring-no-properties
               (point-min)
               (point-max))))
          (setq counsel-spotify-client-id (nth 0 '(split-string(read-from-file "./secret.txt") "\n" t)))
          (setq counsel-spotify-client-secret (nth 1 '(split-string(read-from-file "./secret.txt") "\n" t)))

#+end_src

#+RESULTS:
| read-from-file | ./secret.txt |

* Keybinds
** Which Key

#+begin_src emacs-lisp

  (use-package which-key
    :init (which-key-mode)
    :diminish which-key mode
    :config
    (setq which-key-idle-delay 0.3))

#+end_src

** General

#+begin_src emacs-lisp

  (use-package general
    :config
    (general-evil-setup t)
    (general-auto-unbind-keys)

    (general-create-definer pry/leader-keys
      :keymaps '(normal visual insert emacs)
      :prefix "C-<tab>"
      :non-normal-prefix "C-<tab>"
      :global-prefix "C-<tab>")

    (pry/leader-keys
      "t" '(:ignore t :which-key "toggles")
      "tt" '(load-theme :which-key "choose theme")
      "o" '(:ignore t :which-key "org commands")
      "oa" '(org-agenda :which-key "agenda menu")
      "ot" '(org-babel-tangle :which-key "tangle")
      "m" '(:ignore t :which-key "magit commands")
      "ms" '(magit-status :which-key "magit status")
      "p" '(:ignore t :which-key "projectile")
      "pf" '(counsel-projectile-find-file :which-key "find file")
      "pb" '(counsel-projectile-switch-to-buffer :which-key "switch buffer")
      "l" '(:ignore t :which-key "lsp")
      "lf" '(lsp-format-buffer :which-key "format")
      "ld" '(flymake-show-buffer-diagnostics :which-key "diagnostics")
      "c" '(:ignore t :which-key "comment")
      "cl" '(comment-line :which-key "line")
      "cr" '(comment-region :which-key "region")) 



    (pry/leader-keys "ts" '(hydra-text-scale/body :which-key "scale text"))
    (pry/leader-keys "tw" '(hydra-resize-window/body :which-key "resize window")))

#+end_src

#+RESULTS:
: t

** Hydra

#+begin_src emacs-lisp

  (use-package hydra)

  (defhydra hydra-text-scale ()
    "scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("q" nil "quit" :exit t))

  (defhydra hydra-resize-window ()
    "resize window"
    ("l" enlarge-window-horizontally "enlarge vertical")
    ("h" shrink-window-horizontally "shrink vertical")
    ("j" enlarge-window "enlarge horizontal")
    ("k" shrink-window "shrink horizontal")
    ("q" nil "quit" :exit t))

#+end_src

** Escape as quit key (sometimes :/ )

#+begin_src emacs-lisp

  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
  
#+end_src

** Disable Mouse 

#+begin_src emacs-lisp
  
  (use-package disable-mouse)
  (global-disable-mouse-mode)
  (mapc #'disable-mouse-in-keymap
        (list evil-motion-state-map
              evil-normal-state-map
              evil-visual-state-map
              evil-insert-state-map))

#+end_src



* Fixes

